home/DOT_emacs.d/init.org
#+PROPERTY: tangle yes
#+PROPERTY: tangle-file init.el

* General Configuration
** Splash Screen
   Turn off the splash screen.
   #+BEGIN_SRC emacs-lisp
     (setq inhibit-splash-screen t)
   #+END_SRC
** Setup Default And Initial Frame Parameters
   Default frame parameters.  These will also apply to the initial
   frame unless they are overridden in =initial-frame-alist=.
   #+BEGIN_SRC emacs-lisp
     (setq default-frame-alist
	   `(;; menu-bar-lines and tool-bar-lines are how old
	     ;; versions of emacs (before 24) initialised the
	     ;; menu & tool bars.  Now we just check the
	     ;; values of menu-bar-mode and tool-bar-mode.
	     (menu-bar-lines . 0)
	     (tool-bar-lines . 0)))
   #+END_SRC
   Turn off the scroll bar, we have the position in file displayed for us
   already, and the mouse wheel works fine for scrolling through the file.
   #+BEGIN_SRC emacs-lisp
     (set-scroll-bar-mode nil)
     (if (fboundp 'horizontal-scroll-bar-mode)
         (horizontal-scroll-bar-mode -1))
   #+END_SRC

** Loading Global Initialisation
   Don't load the global configuration.  Anything that's in the global
   configuration that I want I'll place in my own configuration anyway, and
   often the distributions will add configuration setting that I don't
   want, and as the global configuration is loaded after mine, then my
   settings get corrupted.
   #+BEGIN_SRC emacs-lisp
     (setq inhibit-default-init t)
   #+END_SRC
** Frame Title
   This sets the frame title to contain the full filename if we're visiting
   a file in the current buffer, or to the buffer name if we're not
   visiting a file.
   #+BEGIN_SRC emacs-lisp
     (setq frame-title-format
           (list '(using-xemacs
                  "xemacs: "
                  "emacs: ")
                 '(buffer-file-name
                  "%f"
                  (dired-directory dired-directory "%b"))))
   #+END_SRC
** Emacs Package System And Load Path
*** Built-in Package System
    First, where are we going to get packages from.
    #+BEGIN_SRC emacs-lisp
      (setq package-archives
            '(("org" . "http://orgmode.org/elpa/")
              ("gnu" . "http://elpa.gnu.org/packages/")
              ("marmalade" . "http://marmalade-repo.org/packages/")
              ("melpa" . "http://melpa.org/packages/")))
    #+END_SRC
    Now, arrange to load the packages immediately.
    #+BEGIN_SRC emacs-lisp
      (setq package-enable-at-startup nil)
      (package-initialize)
    #+END_SRC
*** Random Other Packages
    There are packages I'd like to use that are not in any of the
    archives that I use.  I download these myself and place them into
    my local packages directory.
    This code extends the =load-path= so that the packages can be found.
    #+BEGIN_SRC emacs-lisp
      (defconst elisp-directory (expand-file-name "~/.emacs.d"))
      (add-to-list 'load-path (concat elisp-directory "/packages"))
      (add-to-list 'load-path (concat elisp-directory "/my-elisp"))
    #+END_SRC
    On some machines I have an updated version of =org-mode= downloaded,
    this ensures that I use it when it's available:
    #+BEGIN_SRC emacs-lisp
      (add-to-list 'load-path (concat elisp-directory "/org-mode/lisp"))
    #+END_SRC
    The following directory is not present on all my machines, but if
    it is, this is where I place a patched version of cc-mode.
    #+BEGIN_SRC emacs-lisp
      (add-to-list 'load-path (concat elisp-directory "/cc-mode"))
    #+END_SRC
    The patched version contains just the following patch at the
    moment:
    #+BEGIN_SRC diff :tangle no
      diff -r 29497e41f1b3 cc-defs.el
      --- a/cc-defs.el        Sat Aug 23 10:42:30 2014 +0000
      +++ b/cc-defs.el        Tue Sep 16 10:53:37 2014 +0100
      @@ -364,7 +364,9 @@
                 (zmacs-activate-region)
               (zmacs-deactivate-region))
           ;; Emacs.
      -    `(setq mark-active ,activate)))
      +    `(if ,activate
      +         (activate-mark)
      +       (deactivate-mark))))
       
       (defmacro c-delete-and-extract-region (start end)
         "Delete the text between START and END and return it."
    #+END_SRC
    Loading the development version of =cedet= is a little more
    involved, we need to load a special package to activate the
    development version:
    #+BEGIN_SRC emacs-lisp
      (when (file-exists-p
             (concat elisp-directory "/cedet"))
        (add-to-list 'load-path (concat elisp-directory "/cedet"))
        (require 'cedet-devel-load))
    #+END_SRC
*** Org Mode Fixes
    Get this in early, before anything has a chance to trigger loading
    of =org-mode=.  These small packages include some bug fixes, and
    small extensions to =org-mode=.  Ideally I'll push these back
    upstream when time allows.
    #+BEGIN_SRC emacs-lisp
      (add-hook 'org-load-hook
                (progn
                  (require 'andrew-org)
                  (require 'andrew-org-capture)))
    #+END_SRC
** Buffer Switching
   Use =ibuffer= rather than =list-buffers= for buffer switching.
   First turn it on, and arrange for line highlighting to be turned on
   in the buffer selection buffer.  The call to redisplay ensures that
   when the buffer selection buffer appears the line highlighting is
   immediately visible, without this, the line highlight is not
   visible until a key is pressed.
   #+BEGIN_SRC emacs-lisp
     (global-set-key (kbd "C-x C-b") 'ibuffer)
     (add-hook 'ibuffer-mode-hook (lambda ()
                                    (hl-line-mode 1)
                                    (ibuffer-auto-mode)))
   #+END_SRC
   There's a little problem when trying to use =hl-line-mode= alongside
   with =ibuffer-auto-mode=, the =ibuffer-auto-mode= installs a
   =post-command-hook= to update the buffer list, this causes the line
   highlighting to be lost.  The solution is to advice the ibuffer
   redisplay engine to restore the highlighting.
   #+BEGIN_SRC emacs-lisp
     (eval-after-load "hl-line"
       '(defadvice ibuffer-redisplay-engine (after
                                             andrew-ibuffer-redisplay
                                             activate)
          (hl-line-highlight)))
   #+END_SRC
   Finally, to make sure that we use =ibuffer= everywhere we'd otherwise
   use =list-buffers= setup an alias,
   #+BEGIN_SRC emacs-lisp
     (defalias 'list-buffers 'ibuffer)
   #+END_SRC
** Mode Line Configuration.
   Turn on column and line numbers in the mode line.
   #+BEGIN_SRC emacs-lisp
     (setq line-number-mode t)
     (setq column-number-mode t)
   #+END_SRC
** Mini-Buffer
   Don't let the point enter the text of the mini-buffer prompt, keep the
   prompt text as read-only.
   #+BEGIN_SRC emacs-lisp
     (setq minibuffer-prompt-properties
           '(read-only t
             point-entered minibuffer-avoid-prompt
             face minibuffer-prompt))
   #+END_SRC
** Kill 'n' Yank In Terminals
   This provides access to the x-clipboard from the terminal, allowing
   kill and yank operations to work either between terminal windows,
   or between X windows and the terminal.
   #+BEGIN_SRC emacs-lisp
     (when (fboundp 'xclip-mode)
       (xclip-mode 1))
   #+END_SRC
** Bookmarks
   Save bookmarks whenever I change one.
   #+BEGIN_SRC emacs-lisp
     (setq bookmark-save-flag 1)
   #+END_SRC
** Highlight Selection
   This causes the selection to be highlighted.
   #+BEGIN_SRC emacs-lisp
     (transient-mark-mode t)
   #+END_SRC
** Indenting
   Don't insert tabs when indenting.
   #+BEGIN_SRC emacs-lisp
     (set-default `indent-tabs-mode nil)
   #+END_SRC
** Overwrite Current Selection
   Typing when the region is active will replace the current region.
   #+BEGIN_SRC emacs-lisp
     (delete-selection-mode t)
   #+END_SRC
** Mouse Cursor Control
*** Move Away From Point
    Have the cursor move away from point.  This doesn't do much on my
    laptop, where the cursor /goes invisible/ when I'm typing, then
    doesn't seem to move.  Should investigate to see if this ever does
    anything.
    #+BEGIN_SRC emacs-lisp
      (if (display-graphic-p)
          (mouse-avoidance-mode 'cat-and-mouse))

    #+END_SRC
** Make Scripts Executable
   When we save a script try to make it executable.  Currently this
   only works for files ending in =.pl= or =.sh=, but it would be quite
   nice to extend this to spot files that have a =#!= as the first 2
   characters.
   #+BEGIN_SRC emacs-lisp
     (add-hook 'after-save-hook
        '(lambda ()
           (let ( (temp (substring buffer-file-name -3)) )
             (if (or (equal temp ".pl")
                     (equal temp ".sh"))
                 (executable-make-buffer-file-executable-if-script-p)))))
   #+END_SRC
** Disabled Commands
   These commands are disabled by default, but are actually useful.
   #+BEGIN_SRC emacs-lisp
     (put 'narrow-to-region 'disabled nil)
     (put 'upcase-region 'disabled nil)
     (put 'downcase-region 'disabled nil)
   #+END_SRC
* Setup Autoloads
  #+BEGIN_SRC emacs-lisp
    (autoload 'r-mode "ess-site")
    (autoload 'javascript-mode "javascript" nil t)
    (autoload 'forth-mode "gforth")

    (autoload 'andrew-cperl-mode "andrew-cperl-mode")
    (autoload 'andrew-cc-mode "andrew-cc-mode")
    (autoload 'jump-to-matching-paren "mparen")
    (autoload 'toggle-menubar-and-toolbar "menu-toggle")
  #+END_SRC
* Setup Auto Mode Alist
  #+BEGIN_SRC emacs-lisp
    ;; I create gdb command scripts as *.gdb
    (add-to-list 'auto-mode-alist '("\\.gdb\\'" . gdb-script-mode))
    ;; Take care of supporting R mode.
    (add-to-list 'auto-mode-alist '("\\.R\\'" . r-mode))
    ;; Javascript support.
    (add-to-list 'auto-mode-alist (cons  "\\.js\\'" 'javascript-mode))
    ;; Lots of different extensions for FORTH
    (add-to-list 'auto-mode-alist '("\\.of\\'"  . forth-mode))
    (add-to-list 'auto-mode-alist '("\\.fs\\'"  . forth-mode))
    (add-to-list 'auto-mode-alist '("\\.fs\\'"  . forth-mode))
    (add-to-list 'auto-mode-alist '("\\.fth\\'" . forth-mode))
    ;; Org Mode
    (add-to-list 'auto-mode-alist '("\\.org$" . org-mode))
    ;; Ensure we use cperl-mode not perl-mode
    (mapc
     (lambda (pair)
       (if (eq (cdr pair) 'perl-mode)
           (setcdr pair 'cperl-mode)))
     (append auto-mode-alist interpreter-mode-alist))
    ;; Start in the right mode when editing mutt files.
    (add-to-list 'auto-mode-alist '("/mutt" . mail-mode))
  #+END_SRC
* Package Configuration
** Create A Keymap
   I create a keymap into which I can place bindings for various
   package functions.  Some of the more useful bindings will get
   promoted to top level bindings over time.
   The key-map I create is bound to =C-x C-a=.
   #+BEGIN_SRC emacs-lisp
     (setq ctl-x-a-map (make-sparse-keymap))
     (define-key ctl-x-map "\C-a" ctl-x-a-map)
   #+END_SRC
** Require Some Packages
   Should revisit this to see if I really need to require the packages
   at this point, or if I could setup some autoloads, and load the
   files later.
   #+BEGIN_SRC emacs-lisp
     ;; Allow blocks to be hidden / shown on demand.
     (require 'hideshow)
     ;; For doing haskell - will fail silently if haskell mode is not available on
     ;; the machine that this emacs is being run on.
     (require 'haskell-mode nil t)
     ;; Linker script mode.
     (require 'ld-script)
   #+END_SRC
