home/DOT_emacs.d/init.el
(setq inhibit-splash-screen t)

(setq default-frame-alist
      `(;; menu-bar-lines and tool-bar-lines are how old
        ;; versions of emacs (before 24) initialised the
        ;; menu & tool bars.  Now we just check the
        ;; values of menu-bar-mode and tool-bar-mode.
        (menu-bar-lines . 0)
        (tool-bar-lines . 0)))

(set-scroll-bar-mode nil)
(if (fboundp 'horizontal-scroll-bar-mode)
    (horizontal-scroll-bar-mode -1))

(setq inhibit-default-init t)

(setq frame-title-format
      (list '(using-xemacs
             "xemacs: "
             "emacs: ")
            '(buffer-file-name
             "%f"
             (dired-directory dired-directory "%b"))))

(setq package-archives
      '(("org" . "http://orgmode.org/elpa/")
        ("gnu" . "http://elpa.gnu.org/packages/")
        ("marmalade" . "http://marmalade-repo.org/packages/")
        ("melpa" . "http://melpa.milkbox.net/packages/")))

(setq package-enable-at-startup nil)
(package-initialize)

(defconst elisp-directory (expand-file-name "~/.emacs.d"))
(add-to-list 'load-path (concat elisp-directory "/packages"))
(add-to-list 'load-path (concat elisp-directory "/my-elisp"))

(add-to-list 'load-path (concat elisp-directory "/cc-mode"))

(when (file-exists-p
       (concat elisp-directory "/cedet"))
  (add-to-list 'load-path (concat elisp-directory "/cedet"))
  (require 'cedet-devel-load))

(global-set-key (kbd "C-x C-b") 'ibuffer)
(add-hook 'ibuffer-mode-hook (lambda ()
                               (hl-line-mode 1)
                               (ibuffer-auto-mode)))

(eval-after-load "hl-line"
  '(defadvice ibuffer-redisplay-engine (after
                                        andrew-ibuffer-redisplay
                                        activate)
     (hl-line-highlight)))

(defalias 'list-buffers 'ibuffer)

(setq line-number-mode t)
(setq column-number-mode t)

(setq minibuffer-prompt-properties
      '(read-only t
        point-entered minibuffer-avoid-prompt
        face minibuffer-prompt))

(when (fboundp 'xclip-mode)
  (xclip-mode 1))

(setq bookmark-save-flag 1)

(transient-mark-mode t)

(set-default `indent-tabs-mode nil)

(delete-selection-mode t)

(if (display-graphic-p)
    (mouse-avoidance-mode 'cat-and-mouse))

(add-hook 'after-save-hook
   '(lambda ()
      (let ( (temp (substring buffer-file-name -3)) )
        (if (or (equal temp ".pl")
                (equal temp ".sh"))
            (executable-make-buffer-file-executable-if-script-p)))))

(put 'narrow-to-region 'disabled nil)
(put 'upcase-region 'disabled nil)
(put 'downcase-region 'disabled nil)

(autoload 'r-mode "ess-site")
(autoload 'javascript-mode "javascript" nil t)
(autoload 'forth-mode "gforth")

(autoload 'andrew-cperl-mode "andrew-cperl-mode")
(autoload 'andrew-cc-mode "andrew-cc-mode")
(autoload 'jump-to-matching-paren "mparen")
(autoload 'toggle-menubar-and-toolbar "menu-toggle")

;; I create gdb command scripts as *.gdb
(add-to-list 'auto-mode-alist '("\\.gdb\\'" . gdb-script-mode))
;; Take care of supporting R mode.
(add-to-list 'auto-mode-alist '("\\.R\\'" . r-mode))
;; Javascript support.
(add-to-list 'auto-mode-alist (cons  "\\.js\\'" 'javascript-mode))
;; Lots of different extensions for FORTH
(add-to-list 'auto-mode-alist '("\\.of\\'"  . forth-mode))
(add-to-list 'auto-mode-alist '("\\.fs\\'"  . forth-mode))
(add-to-list 'auto-mode-alist '("\\.fs\\'"  . forth-mode))
(add-to-list 'auto-mode-alist '("\\.fth\\'" . forth-mode))
;; Org Mode
(add-to-list 'auto-mode-alist '("\\.org$" . org-mode))
;; Ensure we use cperl-mode not perl-mode
(mapc
 (lambda (pair)
   (if (eq (cdr pair) 'perl-mode)
       (setcdr pair 'cperl-mode)))
 (append auto-mode-alist interpreter-mode-alist))
;; Start in the right mode when editing mutt files.
(add-to-list 'auto-mode-alist '("/mutt" . mail-mode))

(setq ctl-x-a-map (make-sparse-keymap))
(define-key ctl-x-map "\C-a" ctl-x-a-map)

;; Allow blocks to be hidden / shown on demand.
(require 'hideshow)
;; For doing haskell - will fail silently if haskell mode is not available on
;; the machine that this emacs is being run on.
(require 'haskell-mode nil t)
;; Linker script mode.
(require 'ld-script)

(define-key ctl-x-a-map "j" 'ace-jump-word-mode)
(define-key ctl-x-a-map "J" 'ace-jump-char-mode)
