home/DOT_emacs.d/init.org
** ACE Navigation
   The ace navigation system is a pretty neat way of jumping around within
   the visible area of a buffer, however, the original ace packages
   are now pretty much unmaintained.  Luckily, there's now =avy= which
   is a replacement.  The ace-window, is, strangely not part of the
   original ace jump package, but is written by the same person who
   has now written the avy replacement package.
   Add the avy navigation commands into my personal key-map.
   #+BEGIN_SRC emacs-lisp
     (define-key ctl-x-a-map "j" 'avy-goto-word-or-subword-1)
     (define-key ctl-x-a-map "J" 'avy-goto-char)
     (define-key ctl-x-a-map "o" 'ace-window)
   #+END_SRC
   And because the avy jumping is just so useful, find an even
   shorter keymap for that action.
   #+BEGIN_SRC emacs-lisp
     (global-set-key (kbd "C-c /") 'avy-goto-word-or-subword-1)
     (global-set-key (kbd "C-c w") 'ace-window)
   #+END_SRC
   Finally, some package customisation.
   #+BEGIN_SRC emacs-lisp
     (with-eval-after-load 'avy
       (setq avy-background 't)
       (set-face-attribute 'avy-lead-face nil
       :foreground "red"
       :background 'unspecified))
   #+END_SRC
** Fill Column Indictator
   This package draws a faint marker down the right hand side, indicating
   where the fill column is.  First, add a key-binding to toggle the
   marker.
   #+BEGIN_SRC emacs-lisp
     (when (fboundp 'fci-mode)
       (global-set-key (kbd "C-c |") 'fci-mode))
   #+END_SRC
   Now turn the mode on by default in a set of common language modes.
   #+BEGIN_SRC emacs-lisp
     (when (fboundp 'fci-mode)
       (add-hook 'c-mode-common-hook 'fci-mode)
       (add-hook 'cperl-mode-hook 'fci-mode)
       (add-hook 'emacs-lisp-mode-hook 'fci-mode))
   #+END_SRC
** =iedit= mode
   This is lifted from the =iedit.el= file.  The autoloads for iedit
   don't setup the default keybinding.  The choices then are either
   fully load iedit now, or setup the default keybinding myself.  I
   choose the later to reduce load time.
   #+BEGIN_SRC emacs-lisp
     (defvar iedit-toggle-key-default (kbd "C-;"))
     (define-key global-map iedit-toggle-key-default 'iedit-mode)
     (define-key isearch-mode-map iedit-toggle-key-default 'iedit-mode-from-isearch)
     (define-key esc-map iedit-toggle-key-default 'iedit-execute-last-modification)
     (define-key help-map iedit-toggle-key-default 'iedit-mode-toggle-on-function)
     (define-key global-map (kbd "C-c ;") 'iedit-mode-toggle-on-function)
   #+END_SRC
** =icomplete+= mode
   With =icomplete-mode= we get completion suggestions in the
   mini-buffer.  The =icomplete+= provides some small improvements on
   top.
   #+BEGIN_SRC emacs-lisp
     (require 'icomplete+ nil t)
     (icomplete-mode)
   #+END_SRC
** Undo Tree
   Easy undo navigation.
   #+BEGIN_SRC emacs-lisp
     (when (fboundp 'global-undo-tree-mode)
       (global-undo-tree-mode 1))
   #+END_SRC
** Window Configuration Undo Mode
   This provides a simple undo / redo mechanism for the window
   configuration, though sadly the redo is not as good as the undo.
   Would be nice, one day, to try and improve this so that the undo
   and redo are equally as powerful.
   #+BEGIN_SRC emacs-lisp
     (winner-mode 1)
   #+END_SRC
** Improved Rectangle Selection With CUA
   The =cua-mode= stuff, in general, is not to my taste, that's the
   Ctrl-x, Ctrl-c, Ctrl-v, for cut, copy, paste.  However, the
   rectangle selection stuff is pretty great.  Luckily we can have
   the rectangle stuff without the reset.
   #+BEGIN_SRC emacs-lisp
     (cua-selection-mode 1)
   #+END_SRC
** Diff Mode
   Make diff mode a little more git friendly.  I find it hard to
   believe that I'm the only person to want this, so I assume there's
   a better way to get this functionality, should figure out what that
   is and use that instead.
   #+BEGIN_SRC emacs-lisp
     (defun andrew-configure-diff-mode ()
       (font-lock-add-keywords
        nil
        '(("^index \\(.+\\).*\n"
           (0 diff-header-face) (1 diff-index-face prepend))
          ("^diff --git \\(.+\\).*\n"
           (0 diff-header-face) (1 diff-file-header-face prepend))
          ))
       )

     (add-hook 'diff-mode-hook 'andrew-configure-diff-mode)
   #+END_SRC
** Forth Mode
   #+BEGIN_SRC emacs-lisp
     (add-hook 'forth-mode-hook
               '(lambda ()
                  (setq forth-indent-level 2)
                  (setq forth-minor-indent-level 1)
                  (setq forth-custom-words
                        '((("QT\"")
                           compile-only
                           (font-lock-string-face . 1)
                           "[\"\n]" nil string
                           (font-lock-string-face . 1))))))
   #+END_SRC
** Javascript Mode
   #+BEGIN_SRC emacs-lisp
     (add-hook 'javascript-mode-hook
               '(lambda () (setq js-indent-level 2)))
   #+END_SRC
** Latex Mode
   #+BEGIN_SRC emacs-lisp
     (add-hook 'latex-mode-hook
               '(lambda ()
                  (auto-fill-mode 1)
                  (flyspell-mode 1)
                  (setq LaTeX-figure-label "figure:")
                  (setq LaTeX-table-label "table:")))
   #+END_SRC
** Spell Checking
   #+BEGIN_SRC emacs-lisp
     ;; Set up the spell checker to use.
     ;; Thve alternative is ispell - but aspell gives better suggestions.
     (setq-default ispell-program-name "aspell")
     ;;
     ;; Make sure that we pick up the correct dictionary name.
     ;; In truth only the ispell-dictionary needs to be set, but
     ;; it is nice to set them both just to be on the safe side.
     ;;
     (if (string-equal ispell-program-name "aspell")
       ;; aspell has 'british' dictionary.
       (progn (setq flyspell-default-dictionary "british")
              (setq ispell-dictionary "british"))
       ;;
       ;; ispell calls it an english dictionary.
       (progn (setq flyspell-default-dictionary "english")
              (setq ispell-dictionary "english")))

     (require 'andrew-ispell)
   #+END_SRC
** Configure Perl
   #+BEGIN_SRC emacs-lisp
     ;; A bug in emacs 24 causes the following line to be needed.
     ;; Would be nice to remove this one day.
     (if (>= emacs-major-version 24)
         (progn
           (defvar cperl-invalid-face nil)
           (setq cperl-highlight-variables-indiscriminately 't)))

     ;; Now load my cperl customisations when entering cperl-mode.
     (add-hook 'cperl-mode-hook 'andrew-cperl-mode)
   #+END_SRC
** Configure C and C++
   #+BEGIN_SRC emacs-lisp
     (add-hook 'c-mode-hook 'andrew-cc-mode)
     (add-hook 'c++-mode-hook 'andrew-cc-mode)
   #+END_SRC
** Mail Mode
   Put off loading my email configuration until we actually load
   =mail-mode=, which, doesn't come from a file called =mail-mode=.
   #+BEGIN_SRC emacs-lisp
     (eval-after-load "sendmail" (lambda ()
                                   (message "Loading andrew-email-mode")
                                   (require 'andrew-email-mode)))
   #+END_SRC
** Multi-Cursor Mode
   The only thing needed here is to setup some useful keybindings.
   #+BEGIN_SRC emacs-lisp
     (define-key ctl-x-a-map "e" 'mc/edit-lines)
   #+END_SRC
* Other
** Simple Helper Functions
*** Detect xemacs
    I don't use xemacs much anymore, but there was a time when I did,
    and it was nice to have a helper function to detect it.
    #+BEGIN_SRC emacs-lisp
      (defun using-xemacs ()
        (string-match "XEmacs\\|Lucid" emacs-version))
    #+END_SRC
*** Convert DOS Format To Unix
    This converts dos format files to unix format files.  I'm pretty
    sure there's a /better/ way to do this using the file encoding,
    however, I've had this helper around forever, and I still use if
    from time to time.  I should figure out what the built-in way is
    and use that instead.
    #+BEGIN_SRC emacs-lisp
      (defun dos2unix ()
        "Convert dos formatted buffer to unix formatted buffer by
      removing\nany \\r characters."
        (interactive)
        (let ((current-point-position (point)))
          (progn
            (message "dos2unix: Converting dos characters '\r' to ''")
            (goto-char (point-min))
            (while (search-forward "\r" nil t) (replace-match ""))
            (goto-char current-point-position)))
            (message "dos2unix: done."))
    #+END_SRC
** Parentheses Highlighting
   #+BEGIN_SRC emacs-lisp
     (show-paren-mode t)
     (if (display-graphic-p)
         (setq show-paren-style 'expression)
       (setq show-paren-style 'parenthesis))
       #+END_SRC
** Truncate Lines
   Turn on truncate lines, lines will extend off the right side of the
   screen rather than wrapping onto the line below.
   #+BEGIN_SRC emacs-lisp
     (set-default `truncate-lines t)

     (defun toggle-truncate-lines ()
       "Toggle value of truncate-lines and refresh window display."
       (interactive)
       (setq truncate-lines (not truncate-lines))
       ;; now refresh window display (an idiom from simple.el):
       (save-excursion
         (set-window-start (selected-window)
                           (window-start (selected-window)))))
   #+END_SRC
** Cursor Tweaks
*** Change Colour For Overwrite Mode
    When we enter overwrite mode, change the cursor colour.
    #+BEGIN_SRC emacs-lisp
      (defvar cursor-default-colour "LimeGreen")
      (defvar cursor-overwrite-colour "red")

      (defun cursor-overwrite-mode ()
        "Set cursor colour according to insert mode"
        (set-cursor-color
         (if overwrite-mode
             cursor-overwrite-colour
             cursor-default-colour)))
      (add-hook 'post-command-hook 'cursor-overwrite-mode)
    #+END_SRC
*** Remember Position Per Window
    #+BEGIN_SRC emacs-lisp
      (when (require 'winpoint nil t)
        (winpoint-mode 1))
    #+END_SRC
*** Change Shape When Mark Is Set
    When the mark is set change the shape of the cursor.  This is
    nice, but can sometimes break, leaving the cursor in the wrong
    shape.  This depends on the hooks being triggered, sadly, in some
    places the underlying variable is accessed directly, without going
    through the API that causes the hook to fire.  One prime example
    is in =c-mode= where the electric parentheses code will cause the
    activate mark hook to fire when it should not, without a matching
    call to deactivate mark.  Still, the following works more than it
    does not, so I prefer to keep it around.
    #+BEGIN_SRC emacs-lisp
      (defun cursor-activate-mark ()
        "Function to call when the mark is activated."
        (progn
          (setq cursor-type 'bar)))
      (add-hook 'activate-mark-hook 'cursor-activate-mark)

      (defun cursor-deactivate-mark ()
        "Function to call when the mark is deactivated."
        (progn
          (setq cursor-type 'box)))
      (add-hook 'deactivate-mark-hook 'cursor-deactivate-mark)
    #+END_SRC
