home/DOT_emacs.d/init.el
(define-key ctl-x-a-map "o" 'ace-window)

(global-set-key (kbd "C-x /") 'ace-jump-word-mode)

(when (fboundp 'fci-mode)
  (global-set-key (kbd "C-x |") 'fci-mode))

(when (fboundp 'fci-mode)
  (add-hook 'c-mode-common-hook 'fci-mode)
  (add-hook 'cperl-mode-hook 'fci-mode)
  (add-hook 'emacs-lisp-mode-hook 'fci-mode))

(defvar iedit-toggle-key-default (kbd "C-;"))
(define-key global-map iedit-toggle-key-default 'iedit-mode)
(define-key isearch-mode-map iedit-toggle-key-default 'iedit-mode-from-isearch)
(define-key esc-map iedit-toggle-key-default 'iedit-execute-last-modification)
(define-key help-map iedit-toggle-key-default 'iedit-mode-toggle-on-function)

(require 'icomplete+ nil t)
(icomplete-mode)

(when (fboundp 'global-undo-tree-mode)
  (global-undo-tree-mode 1))

(winner-mode 1)

(cua-selection-mode 1)

(defun andrew-configure-diff-mode ()
  (font-lock-add-keywords
   nil
   '(("^index \\(.+\\).*\n"
      (0 diff-header-face) (1 diff-index-face prepend))
     ("^diff --git \\(.+\\).*\n"
      (0 diff-header-face) (1 diff-file-header-face prepend))
     ))
  )

(add-hook 'diff-mode-hook 'andrew-configure-diff-mode)

(add-hook 'forth-mode-hook
          '(lambda ()
             (setq forth-indent-level 2)
             (setq forth-minor-indent-level 1)
             (setq forth-custom-words
                   '((("QT\"")
                      compile-only
                      (font-lock-string-face . 1)
                      "[\"\n]" nil string
                      (font-lock-string-face . 1))))))

(add-hook 'javascript-mode-hook
          '(lambda () (setq js-indent-level 2)))

(add-hook 'latex-mode-hook
          '(lambda ()
             (auto-fill-mode 1)
             (flyspell-mode 1)
             (setq LaTeX-figure-label "figure:")
             (setq LaTeX-table-label "table:")))

;; Set up the spell checker to use.
;; Thve alternative is ispell - but aspell gives better suggestions.
(setq-default ispell-program-name "aspell")
;;
;; Make sure that we pick up the correct dictionary name.
;; In truth only the ispell-dictionary needs to be set, but
;; it is nice to set them both just to be on the safe side.
;;
(if (string-equal ispell-program-name "aspell")
  ;; aspell has 'british' dictionary.
  (progn (setq flyspell-default-dictionary "british")
         (setq ispell-dictionary "british"))
  ;;
  ;; ispell calls it an english dictionary.
  (progn (setq flyspell-default-dictionary "english")
         (setq ispell-dictionary "english")))

(require 'andrew-ispell)

;; A bug in emacs 24 causes the following line to be needed.
;; Would be nice to remove this one day.
(if (>= emacs-major-version 24)
    (progn
      (defvar cperl-invalid-face nil)
      (setq cperl-highlight-variables-indiscriminately 't)))

;; Now load my cperl customisations when entering cperl-mode.
(add-hook 'cperl-mode-hook 'andrew-cperl-mode)

(add-hook 'c-mode-hook 'andrew-cc-mode)
(add-hook 'c++-mode-hook 'andrew-cc-mode)

(eval-after-load "sendmail" (lambda ()
                              (message "Loading andrew-email-mode")
                              (require 'andrew-email-mode)))

(define-key ctl-x-a-map "e" 'mc/edit-lines)

(defun using-xemacs ()
  (string-match "XEmacs\\|Lucid" emacs-version))

(defun dos2unix ()
  "Convert dos formatted buffer to unix formatted buffer by
removing\nany \\r characters."
  (interactive)
  (let ((current-point-position (point)))
    (progn
      (message "dos2unix: Converting dos characters '\r' to ''")
      (goto-char (point-min))
      (while (search-forward "\r" nil t) (replace-match ""))
      (goto-char current-point-position)))
      (message "dos2unix: done."))

(show-paren-mode t)
(if (display-graphic-p)
    (setq show-paren-style 'expression)
  (setq show-paren-style 'parenthesis))

(set-default `truncate-lines t)

(defun toggle-truncate-lines ()
  "Toggle value of truncate-lines and refresh window display."
  (interactive)
  (setq truncate-lines (not truncate-lines))
  ;; now refresh window display (an idiom from simple.el):
  (save-excursion
    (set-window-start (selected-window)
                      (window-start (selected-window)))))

(defvar cursor-default-colour "LimeGreen")
(defvar cursor-overwrite-colour "red")

(defun cursor-overwrite-mode ()
  "Set cursor colour according to insert mode"
  (set-cursor-color
   (if overwrite-mode
       cursor-overwrite-colour
       cursor-default-colour)))
(add-hook 'post-command-hook 'cursor-overwrite-mode)

(when (require 'winpoint nil t)
  (winpoint-mode 1))

(defun cursor-activate-mark ()
  "Function to call when the mark is activated."
  (progn
    (setq cursor-type 'bar)))
(add-hook 'activate-mark-hook 'cursor-activate-mark)

(defun cursor-deactivate-mark ()
  "Function to call when the mark is deactivated."
  (progn
    (setq cursor-type 'box)))
(add-hook 'deactivate-mark-hook 'cursor-deactivate-mark)
