home/DOT_emacs.d/init.org
** Improved =grep= settings
   This makes grep ignore some obvious things by default.
   #+BEGIN_SRC emacs-lisp
     (eval-after-load "grep"
       (lambda ()
        (grep-apply-setting 'grep-command
                            "grep --exclude='*~' --exclude='.#*' -IHn -e ")))
   #+END_SRC
** Setup Browse Kill Ring
   The =browse-kill-ring= package displays the kill ring in a buffer allowing
   entries to be viewed and selected.
   #+BEGIN_SRC emacs-lisp
     (when (require 'browse-kill-ring nil t)
       (global-set-key "\C-cy" 'browse-kill-ring)

       ;; Temporarily highlight inserted item.
       (setq browse-kill-ring-highlight-inserted-item t)

       ;; Highlight current choice in the kill ring buffer.
       (setq browse-kill-ring-highlight-current-entry t)

       ;; String separating entries in the `separated' style
       (setq browse-kill-ring-separator
             "\n--separator------------------------------")

       ;; Don't allow standard navigation in kill ring buffer.
       (define-key browse-kill-ring-mode-map
         (kbd "<down>") 'browse-kill-ring-forward)
       (define-key browse-kill-ring-mode-map
         (kbd "<up>") 'browse-kill-ring-previous)
       (define-key browse-kill-ring-mode-map
         (kbd "<right>") 'browse-kill-ring-forward)
       (define-key browse-kill-ring-mode-map
         (kbd "<left>") 'browse-kill-ring-previous)

       ;; Face for the separator
       (defface browse-kill-ring-separator
         '((t . (:inherit bold)))
         "Face used for the separator in browse-kill-ring buffer")
       (setq browse-kill-ring-separator-face 'browse-kill-ring-separator))
   #+END_SRC
** Face Customisation
   These are all the face customisations from my old emacs config that I've
   copied over into my new setup.
   #+BEGIN_SRC emacs-lisp
     (if (display-graphic-p)
         (set-face-attribute 'show-paren-mismatch-face
                             nil
                             :strike-through "red"))
   #+END_SRC
   The header line.
   #+BEGIN_SRC emacs-lisp
     (set-face-attribute 'header-line nil
                         :foreground "grey20"
                         :background "grey90"
                         :box '(:line-width 1 :color "red"))
   #+END_SRC
** Line Numbering
   The =linum+= package adds dynamically sized line numbers, based on
   the range of line numbers that are visible on in the window.
   #+BEGIN_SRC emacs-lisp
     (require 'linum+)
   #+END_SRC
   I have a local modification to =linum+= that allows line numbers
   within narrowed regions to be absolute rather than region relative
   which is the default.
   #+BEGIN_SRC emacs-lisp
     (setq linum-narrow-relative nil)
   #+END_SRC
   Change the format used for the =linum+= format line numbers.  This
   format is processed twice, the first time it is called with the
   maximum width required, this creates a format string, this format
   string is then used to print the line numbers.
   #+BEGIN_SRC emacs-lisp
     (if window-system
       (setq linum+-smart-format "%%%dd"
             linum+-dynamic-format "%%%dd"))
   #+END_SRC
   Setup some key-bindings for turning line numbers on and off.
   #+BEGIN_SRC emacs-lisp
     (global-set-key (kbd "C-c n") 'linum-mode)
     (global-set-key (kbd "C-c N") 'global-linum-mode)
   #+END_SRC
   This turns on highlighting of the current line number, not
   highlighting of the current line (that's something different).
   #+BEGIN_SRC emacs-lisp
     (when (require 'hlinum nil t)
       (hlinum-activate))
   #+END_SRC
** White Space Mode
   Highlight trailing whitespace only.  This used to highlight leading
   and trailing empty lines too, but that conflicts with things like
   auto-complete near the end of the buffer, so I've turned it off for
   now.
   #+BEGIN_SRC emacs-lisp
     (setq whitespace-style '(face trailing))
     (global-whitespace-mode)
   #+END_SRC
** Version Control Configuration
*** File Backup
    Setting this to true means create the standard =file~= style
    backups.  The default (=nil=) means emacs creates no backups,
    relying instead on version control for backup.
    #+BEGIN_SRC emacs-lisp
      (setq vc-make-backup-files t)
    #+END_SRC
*** General Configuration
    For now I just turn all the version control stuff off.  I really
    would like to investigate this more though, the magit stuff looks
    great.
    #+BEGIN_SRC emacs-lisp
      (setq vc-handled-backends nil)
      (setq version-control 'never)
    #+END_SRC
** Keybindings
   #+BEGIN_SRC emacs-lisp
     (global-set-key (kbd "C-x <home>") 'beginning-of-buffer)
     (global-set-key (kbd "C-x <end>") 'end-of-buffer)
     ;; For some reason C-<home> and C-<end> don't work inside a terminal.
     (global-unset-key (kbd "C-<home>"))
     (global-unset-key (kbd "C-<end>"))
   #+END_SRC
   This is my preferred binding for =goto-line=, it does loose a useful
   keymap, I should probably try to preserve it.
   #+BEGIN_SRC emacs-lisp
     (global-set-key [?\M-g] 'goto-line)
   #+END_SRC
   Highlight line bindings.
   #+BEGIN_SRC emacs-lisp
     ;; Allow the current line to be highlighted.
     (global-set-key (kbd "C-c h") 'hl-line-mode)
   #+END_SRC
   Grow and shrink window bindings.
   #+BEGIN_SRC emacs-lisp
     ;; Allow me to grow/shrink the window (when spilt horizontally)
     ;; from the keyboard.
     (global-set-key (kbd "C-c <up>") 'enlarge-window)
     (global-set-key (kbd "C-c <down>") 'shrink-window)
   #+END_SRC
   Jump to matching parentheses.
   #+BEGIN_SRC emacs-lisp
     (global-set-key (kbd "C-c #") 'jump-to-matching-paren)
   #+END_SRC
   To open up screen space I turn off the menu and tool bar.  This
   keybinding toggles the bars.
   #+BEGIN_SRC emacs-lisp
     (global-set-key (kbd "<f12>") 'toggle-menubar-and-toolbar)
   #+END_SRC
** Template System
   The file template system.  The templates are located in
   =~/.templates/= directory.  The disable regexp will stop some files
   from having their header line updaed when the buffer is killed.
   #+BEGIN_SRC emacs-lisp
     (require 'template)
     (template-initialize)
     (setq template-auto-update-disable-regexp ".ido.last")
     (setq template-auto-update nil)
     (setq template-message-buffer nil)
   #+END_SRC
** Org Mode Setup
   #+BEGIN_SRC emacs-lisp
     ;;       Org Mode
     (add-to-list 'load-path (concat elisp-directory "/org-mode/lisp"))
     (add-to-list 'load-path (concat elisp-directory "/org-mode/contrib/lisp"))
     (require 'org)
     (add-to-list 'auto-mode-alist '("\\.org$" . org-mode))
     (setq org-log-done t)

     (defun my-org-mode-hook ()
       (auto-fill-mode 1)
       (flyspell-mode 1)
       (setq org-hide-leading-stars t)
       (set-face-attribute 'org-hide nil
                           :foreground "grey30")
       (setq org-hide-emphasis-markers t)
       (setq org-ditaa-jar-path "/usr/share/java/ditaa.jar")
       (set-face-attribute 'org-code nil
                           :inherit 'unspecified
                           :foreground "deep sky blue"))
     (add-hook 'org-mode-hook 'my-org-mode-hook)

     (defun org-file (name)
       (let ((org-directory (expand-file-name "~/.org/")))
         (concat org-directory name)))

     (setq org-agenda-files (list (org-file "")))

     (setq org-default-notes-file (org-file "refile.org"))

     (setq org-refile-targets '((org-agenda-files . (:maxlevel . 1))))

     (define-key global-map "\C-cc" 'org-capture)
     (define-key global-map "\C-cl" 'org-store-link)
     (define-key global-map "\C-ca" 'org-agenda)
   #+END_SRC
** AutoComplete
   #+BEGIN_SRC emacs-lisp
     (when (require 'auto-complete-config nil t)
       (add-to-list 'ac-dictionary-directories
                    (concat elisp-directory "/auto-complete/dict/"))
       (ac-config-default))
   #+END_SRC
   Cycle windows backwards.
   #+BEGIN_SRC emacs-lisp
     ;; Function for moving through the windows backwards
     (defun other-window-backward ()
       "Like other window, but go backwards."
       (interactive)
       (other-window -1))
     (global-set-key (kbd "C-x O") 'other-window-backward)
   #+END_SRC
* The End
  Check that we've got an email address setup.  We take the email from
  the environment.
  #+BEGIN_SRC emacs-lisp
    (if (not (getenv "EMAIL"))
        (progn
          (display-warning
           :warning
           "Missing EMAIL environment variable, setting email to <invalid>.")
          (setq user-mail-address "<invalid>")))
  #+END_SRC
  Print a message to show we're all done.
  #+BEGIN_SRC emacs-lisp
    (message "All done.")
  #+END_SRC
* Appendix
** Useful Notes
*** Regexp Patterns
    1. Regexp matching for "[" or "]" in a character set: =[][]=.
