home/DOT_emacs.d/init.el

(eval-after-load "grep"
  (lambda ()
   (grep-apply-setting 'grep-command
                       "grep --exclude='*~' --exclude='.#*' -IHn -e ")))

(when (require 'browse-kill-ring nil t)
  (global-set-key "\C-cy" 'browse-kill-ring)

  ;; Temporarily highlight inserted item.
  (setq browse-kill-ring-highlight-inserted-item t)

  ;; Highlight current choice in the kill ring buffer.
  (setq browse-kill-ring-highlight-current-entry t)

  ;; String separating entries in the `separated' style
  (setq browse-kill-ring-separator
        "\n--separator------------------------------")

  ;; Don't allow standard navigation in kill ring buffer.
  (define-key browse-kill-ring-mode-map
    (kbd "<down>") 'browse-kill-ring-forward)
  (define-key browse-kill-ring-mode-map
    (kbd "<up>") 'browse-kill-ring-previous)
  (define-key browse-kill-ring-mode-map
    (kbd "<right>") 'browse-kill-ring-forward)
  (define-key browse-kill-ring-mode-map
    (kbd "<left>") 'browse-kill-ring-previous)

  ;; Face for the separator
  (defface browse-kill-ring-separator
    '((t . (:inherit bold)))
    "Face used for the separator in browse-kill-ring buffer")
  (setq browse-kill-ring-separator-face 'browse-kill-ring-separator))

(if (display-graphic-p)
    (set-face-attribute 'show-paren-mismatch-face
                        nil
                        :strike-through "red"))

(set-face-attribute 'header-line nil
                    :foreground "grey20"
                    :background "grey90"
                    :box '(:line-width 1 :color "red"))

(require 'linum+)

(setq linum-narrow-relative nil)

(if window-system
  (setq linum+-smart-format "%%%dd"
        linum+-dynamic-format "%%%dd"))

(global-set-key (kbd "C-c n") 'linum-mode)
(global-set-key (kbd "C-c N") 'global-linum-mode)

(when (require 'hlinum nil t)
  (hlinum-activate))

(setq whitespace-style '(face trailing empty))
(global-whitespace-mode)

(setq vc-make-backup-files t)

(setq vc-handled-backends nil)
(setq version-control 'never)

(global-set-key (kbd "C-x <home>") 'beginning-of-buffer)
(global-set-key (kbd "C-x <end>") 'end-of-buffer)
;; For some reason C-<home> and C-<end> don't work inside a terminal.
(global-unset-key (kbd "C-<home>"))
(global-unset-key (kbd "C-<end>"))

(global-set-key [?\M-g] 'goto-line)

;; Allow the current line to be highlighted.
(global-set-key (kbd "C-c h") 'hl-line-mode)

;; Allow me to grow/shrink the window (when spilt horizontally)
;; from the keyboard.
(global-set-key (kbd "C-x <up>") 'enlarge-window)
(global-set-key (kbd "C-x <down>") 'shrink-window)

(global-set-key (kbd "C-x #") 'jump-to-matching-paren)

(global-set-key (kbd "<f12>") 'toggle-menubar-and-toolbar)

(require 'template)
(template-initialize)
(setq template-auto-update-disable-regexp ".ido.last")
(setq template-auto-update nil)

;;       Org Mode
(add-to-list 'load-path (concat elisp-directory "/org-mode/lisp"))
(add-to-list 'load-path (concat elisp-directory "/org-mode/contrib/lisp"))
(require 'org)
(add-to-list 'auto-mode-alist '("\\.org$" . org-mode))
(setq org-log-done t)

(defun my-org-mode-hook ()
  (auto-fill-mode 1)
  (flyspell-mode 1)
  (setq org-hide-leading-stars t)
  (set-face-attribute 'org-hide nil
                      :foreground "grey30")
  (setq org-hide-emphasis-markers t)
  (setq org-ditaa-jar-path "/usr/share/java/ditaa.jar")
  (set-face-attribute 'org-code nil
                      :inherit 'unspecified
                      :foreground "deep sky blue"))
(add-hook 'org-mode-hook 'my-org-mode-hook)

(defun org-file (name)
  (let ((org-directory (expand-file-name "~/.org/")))
    (concat org-directory name)))

(setq org-agenda-files (list (org-file "")))

(setq org-default-notes-file (org-file "refile.org"))

(setq org-refile-targets '((org-agenda-files . (:maxlevel . 1))))

(define-key global-map "\C-cc" 'org-capture)
(define-key global-map "\C-cl" 'org-store-link)
(define-key global-map "\C-ca" 'org-agenda)

(when (require 'auto-complete-config nil t)
  (add-to-list 'ac-dictionary-directories
               (concat elisp-directory "/auto-complete/dict/"))
  (ac-config-default))

;; Function for moving through the windows backwards
(defun other-window-backward ()
  "Like other window, but go backwards."
  (interactive)
  (other-window -1))
(global-set-key (kbd "C-x O") 'other-window-backward)

(if (not (getenv "EMAIL"))
    (progn
      (display-warning
       :warning
       "Missing EMAIL environment variable, setting email to <invalid>.")
      (setq user-mail-address "<invalid>")))

(message "All done.")
